# Practical No.11:  Write a Pandas program to filter all columns where all entries present, check which rows and columns has a NaN and finally drop rows with any NaNs from the given dataset.

In [3]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Amit', 'Bhavya', 'Chirag', np.nan],
    'Age': [21, 22, np.nan, 25],
    'City': ['Delhi', 'Mumbai', 'Ahmedabad', 'Surat']
}

df = pd.DataFrame(data)
full_columns = df.loc[:, df.notna().all()]
nan_map = df.isna()
cleaned_df = df.dropna()

print("Original Dataframe:")
display(df)

print("Columns with all values present:")
display(full_columns)

print("\nNaN Map (True means missing):")
display(nan_map)

print("\nDataFrame after dropping rows with any NaNs:")
display(cleaned_df)

Original Dataframe:

     Name   Age       City
0    Amit  21.0      Delhi
1  Bhavya  22.0     Mumbai
2  Chirag   NaN  Ahmedabad
3     NaN  25.0      Surat

Columns with all values present:

        City
0      Delhi
1     Mumbai
2  Ahmedabad
3      Surat

NaN Map (True means missing):

    Name    Age   City
0  False  False  False
1  False  False  False
2  False   True  False
3   True  False  False

DataFrame after dropping rows with any NaNs:

     Name   Age    City
0    Amit  21.0   Delhi
1  Bhavya  22.0  Mumbai